Revit 2027 API
Material.UseRenderAppearanceForShading Property
 True to use the render appearance settings for shaded view appearance; false to use the material's color and transparency value for shaded view appearance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseRenderAppearanceForShading { get; set; }
Public Property UseRenderAppearanceForShading As Boolean
	Get
	Set
public:
property bool UseRenderAppearanceForShading {
	bool get ();
	void set (bool value);
}
member UseRenderAppearanceForShading : bool with get, set
Property Value
Boolean
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace